Documents/Renault_ЗапросНаКоммерческуюПомощь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Renault_ЗапросНаКоммерческуюПомощь</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОбращения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ОснованияЗапросаНаКоммерческуюПомощь</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Гарантия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пробег</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГосНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКлиента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ТипыКлиентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_Приоритет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>17</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбращениеКлиента</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.DMS_ОбращениеКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПервичныйИнтерес</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомплектацияАвто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапросДилераСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлатныеРемонты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПродажиАвто</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеАвто</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_СостоянияАвто</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбращенияВДЦ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФункциональныйКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РепутационныеРиски</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮридическиеРиски</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпециалистРено</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БизнесРегион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_БизнесРегионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрохождениеТО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ПрохождениеТО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаличиеДопОборудования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПовтороноеПриобретенияАвто</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьРешенияПоГарантийнымРасценкам</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьРешенияПоКоммерческимРасценкам</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РекомендованнаяКоммерческаяПомощь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусЗапроса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_СостояниеЗапросаНаКоммерческуюПомощь</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CaseNumber</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CaseStatus</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DATE_MODIFIED</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОщущениеКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ОщущенияКлиентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроблемнаяСистемаАвто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ПроблемныеСистемыАвто</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентСкидкиICM</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СогласованиеСТекЛайн</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПожеланиеКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ПожеланияКлиентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентРекомендованноцКоммерческойПомощи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкидкаКлиента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоментарийПричинаУвелеченияСкидки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DateResolved</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытияДосье</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытияДосье</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/Renault_КартинкиИФайлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_КартинкиИФайлы</Name>
			<Comment>Универсальный том хранилищ дополнительных данных</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИмяФайла</Name>
					<Comment>Исходное имя файла для сохранения</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСохранения</Name>
					<Comment>Дата сохранения данных объекта</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерФайла</Name>
					<Comment>Исходный размер файла</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий к файлу / картинке</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Данные</Name>
					<Comment>Хранилище данных картинки или файла</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДанныеВоВнешнемФайле</Name>
					<Comment>Признак того, что данные храняться во внешнем файле</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Картинка</Name>
					<Comment>Признак того, что файл являеться картинкой</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьПоЭлектроннойПочте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект (справочник) для которого необходимо реализовать хренение некоторых данных (например картинок)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Comment>Идентификационная строка, разделяющая данные объекта</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ДополнительнаяИнформацияАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ДополнительнаяИнформацияАвтомобилей</Name>
			<Comment>Дополнительная информация автомобилей</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Хозяин</Name>
					<Comment>Признак хозяина автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пробег</Name>
					<Comment>Признак пробега автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГосНомер</Name>
					<Comment>Признак государственного номера автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТехПаспорт</Name>
					<Comment>Признак номера техпаспорта автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидАвтомобиля</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатаКонсигнации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СервиснаяКнижка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПараллельныйИмпорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатаОкончанияОтсрочкиОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГаражныйНомер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапретНаВнутренниеПерепродажи</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Renault_ЗапросНаКоммерческуюПомощь/Ext/ObjectModule.bsl
Перем КоличествоСтрокДоЗаписи;

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)	
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
КонецПроцедуры

Процедура ПриЗаписи(Отказ)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
	
	//запишем изменения пробега и ГосНомера
	Если ЗначениеЗаполнено(Автомобиль) тогда
		ТекПробег = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег);
		ТекПробег = ?(ТекПробег = Неопределено, 0, ТекПробег);
		Если Пробег < ТекПробег тогда
			Сообщить("Вы указали пробег автомобиля меньше существующего!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
		
	//запишем изменения пробега и ГосНомера
	Если ЗначениеЗаполнено(Автомобиль) тогда
		
		ТекПробег = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег);
		ТекПробег = ?(ТекПробег = Неопределено, 0, ТекПробег);
		Если Пробег > ТекПробег тогда
			Справочники.Автомобили.ЗаписьЗначенияРегистраСведения(Автомобиль, Пробег,Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег,ТекущаяДата());
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ГосНомер) тогда
			Если ГосНомер <> Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер) тогда
				Справочники.Автомобили.ЗаписьЗначенияРегистраСведения(Автомобиль, ГосНомер,Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер,ТекущаяДата());
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)   	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
		
	//Если ЗначениеЗаполнено(Автомобиль) Тогда
	//	Если ЗначениеЗаполнено(ГосНомер) тогда
	//		Если ПроверкаГосНомера(ГосНомер) тогда
	//			Сообщить("Ошибка гос. номер может содержать только цифры и буквы латинского алфавита.");
	//			Отказ = Истина;
	//		КонецЕсли;
	//	КонецЕсли;
	//	
	//КонецЕсли;
	
КонецПроцедуры

Функция ПроверкаГосНомера(ГосНомер)
	
	Для х=0 по СтрДлина(ГосНомер) цикл
		ТекСимвол = Сред(ГосНомер,х,1);
		Если НЕ КодСимвола(ТекСимвол)= 32  //пробел
			и НЕ (КодСимвола(ТекСимвол)>47 и КодСимвола(ТекСимвол)<58) //цифры
			и НЕ (КодСимвола(ТекСимвол)>64 и КодСимвола(ТекСимвол)<91) //большие латинские буквы
			и НЕ (КодСимвола(ТекСимвол)>96 и КодСимвола(ТекСимвол)<123) //маленькие латинские буквы
			Тогда
				Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
		
КонецФункции

Функция СформироватьТабличныйДокументЗКП(ДокументСсылка) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_ЗапросНаКоммерческуюПомощь.CaseNumber,
		|	Renault_ЗапросНаКоммерческуюПомощь.CaseStatus,
		|	Renault_ЗапросНаКоммерческуюПомощь.DATE_MODIFIED,
		|	Renault_ЗапросНаКоммерческуюПомощь.СпециалистРено,
		|	Renault_ЗапросНаКоммерческуюПомощь.БизнесРегион,
		|	Renault_ЗапросНаКоммерческуюПомощь.ТипКлиента,
		|	Renault_ЗапросНаКоммерческуюПомощь.Контрагент,
		|	Renault_ЗапросНаКоммерческуюПомощь.Модель,
		|	Renault_ЗапросНаКоммерческуюПомощь.КомплектацияАвто,
		|	Renault_ЗапросНаКоммерческуюПомощь.Пробег,
		|	Renault_ЗапросНаКоммерческуюПомощь.VIN,
		|	Renault_ЗапросНаКоммерческуюПомощь.ДатаПродажиАвто,
		|	Renault_ЗапросНаКоммерческуюПомощь.ГосНомер,
		|	Renault_ЗапросНаКоммерческуюПомощь.СостояниеАвто,
		|	Renault_ЗапросНаКоммерческуюПомощь.ДатаОбращенияВДЦ,
		|	Renault_ЗапросНаКоммерческуюПомощь.ФункциональныйКод,
		|	Renault_ЗапросНаКоммерческуюПомощь.Гарантия,
		|	Renault_ЗапросНаКоммерческуюПомощь.ПричинаОбращения,
		|	Renault_ЗапросНаКоммерческуюПомощь.Комментарий,
		|	Renault_ЗапросНаКоммерческуюПомощь.ПожеланиеКлиента,
		|	Renault_ЗапросНаКоммерческуюПомощь.ПрохождениеТО,
		|	Renault_ЗапросНаКоммерческуюПомощь.НаличиеДопОборудования,
		|	Renault_ЗапросНаКоммерческуюПомощь.ПлатныеРемонты,
		|	Renault_ЗапросНаКоммерческуюПомощь.ПовтороноеПриобретенияАвто,
		|	Renault_ЗапросНаКоммерческуюПомощь.РепутационныеРиски,
		|	Renault_ЗапросНаКоммерческуюПомощь.ЮридическиеРиски,
		|	Renault_ЗапросНаКоммерческуюПомощь.СтоимостьРешенияПоГарантийнымРасценкам,
		|	Renault_ЗапросНаКоммерческуюПомощь.СтоимостьРешенияПоКоммерческимРасценкам,
		|	Renault_ЗапросНаКоммерческуюПомощь.РекомендованнаяКоммерческаяПомощь,
		|	Renault_ЗапросНаКоммерческуюПомощь.ЗапросДилераСумма,
		|	Renault_ЗапросНаКоммерческуюПомощь.Ответственный
		|ИЗ
		|	Документ.Renault_ЗапросНаКоммерческуюПомощь КАК Renault_ЗапросНаКоммерческуюПомощь
		|ГДЕ
		|	Renault_ЗапросНаКоммерческуюПомощь.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МакетЗКП = ПолучитьМакет("МакетЗКП");
	ОбластьДокумента = МакетЗКП.ПолучитьОбласть("ОбластьДокумента");

	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ПолеСлева = 5;
	ТабДокумент.ПолеСправа = 5;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ЗаполнитьЗначенияСвойств(ОбластьДокумента.Параметры,ВыборкаДетальныеЗаписи);	
		ОбластьДокумента.Параметры.СпециалистРеноТелефон = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойТелефонКлиента(ВыборкаДетальныеЗаписи.СпециалистРено);
		ОбластьДокумента.Параметры.СпециалистРеноEmail = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойEmailКлиента(ВыборкаДетальныеЗаписи.СпециалистРено);
		
		ДЦ = Renault_CRM.ПолучитьДилерскийЦентрПользователя(ВыборкаДетальныеЗаписи.Ответственный);
		ОбластьДокумента.Параметры.BIRКод = ДЦ.BIR;
		ОбластьДокумента.Параметры.АдресДЦ = ДЦ.ОсновнойАдрес;
		
		ОбластьДокумента.Параметры.ОтветственныйТелефон = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойТелефонКлиента(ВыборкаДетальныеЗаписи.Ответственный.Сотрудник);
		ОбластьДокумента.Параметры.ОтветственныйEmail =  Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойEmailКлиента(ВыборкаДетальныеЗаписи.Ответственный.Сотрудник);
		
		ОбластьДокумента.Параметры.КлиентТелефон =  Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойТелефонКлиента(ВыборкаДетальныеЗаписи.Контрагент);
		ОбластьДокумента.Параметры.КлиентАдрес =  Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойEmailКлиента(ВыборкаДетальныеЗаписи.Контрагент);
		ОбластьДокумента.Параметры.КлиентEmail =  Renault_УправлениеКонтактнойИнформацией.АдресКлиента(ВыборкаДетальныеЗаписи.Контрагент);


	КонецЦикла;
	
	ТабДокумент.Вывести(ОбластьДокумента);
	ОбластьПодвал = МакетЗКП.ПолучитьОбласть("ОбластьПодвал");
	ТабДокумент.Вывести(ОбластьПодвал);
	
	Возврат ТабДокумент;

КонецФункции
//#КонецЕсли

Функция СохранитьИПрикрепитьКДокументу(ТабДокумент,ДокументСсылка) Экспорт
	
	//ВременноеИмяФайла = ПолучитьИмяВременногоФайла("XLS"); 
	ПрефиксБланка =  "Бланк_ЗКП_№";
	ИимяБланка = ПрефиксБланка + ДокументСсылка.Номер+".XLS";
	
	//Проверим создав
	ВременноеИмяФайла = КаталогВременныхФайлов()+ИимяБланка;
	
	ТабДокумент.Записать(ВременноеИмяФайла,ТипФайлаТабличногоДокумента.XLS);
	ФайлXLS = Новый Файл(ВременноеИмяФайла);
	
	Если ФайлXLS.Существует() Тогда
		
		Запрос = новый Запрос(
		"ВЫБРАТЬ
		|	КартинкиИФайлы.Идентификатор,
		|	КартинкиИФайлы.ИмяФайла,
		|	КартинкиИФайлы.ДатаСохранения,
		|	КартинкиИФайлы.Комментарий,
		|	КартинкиИФайлы.Данные КАК ХранилищеДанных,
		|	КартинкиИФайлы.Объект
		|ИЗ
		|	РегистрСведений.Renault_КартинкиИФайлы КАК КартинкиИФайлы
		|ГДЕ
		|	КартинкиИФайлы.Объект = &Объект
		|	И КартинкиИФайлы.Наименование ПОДОБНО &Наименование"
		);
		Запрос.УстановитьПараметр("Объект", ДокументСсылка);
		Запрос.УстановитьПараметр("Наименование", "%"+ПрефиксБланка+"%");
	
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			 Идентификатор = Выборка.Идентификатор;
		КонецЦикла;
		
		НаборЗаписей = РегистрыСведений.Renault_КартинкиИФайлы.СоздатьНаборЗаписей();
		
		Если НЕ ЗначениеЗаполнено(Идентификатор) Тогда
			ТекущийНаборЗаписей = НаборЗаписей.Добавить();		 
		Иначе
			НаборЗаписей.Отбор.Идентификатор.Установить(Идентификатор);
			НаборЗаписей.Прочитать();
			ТекущийНаборЗаписей = НаборЗаписей[0];
		КонецЕсли;
				
		ТекущийНаборЗаписей.Объект = ДокументСсылка;
		ТекущийНаборЗаписей.ИмяФайла = ФайлXLS.ПолноеИмя;
		ТекущийНаборЗаписей.ДанныеВоВнешнемФайле = Ложь;
		ТекущийНаборЗаписей.РазмерФайла = ФайлXLS.Размер();
		ТекущийНаборЗаписей.ДатаСохранения = ТекущаяДата();
		
		ТекущийНаборЗаписей.Данные = Новый ХранилищеЗначения(Новый ДвоичныеДанные(ФайлXLS.ПолноеИмя), Новый СжатиеДанных(9));
		ТекущийНаборЗаписей.Наименование = ФайлXLS.ИмяБезРасширения;

		ТекущийНаборЗаписей.Картинка = Ложь;

		Если НЕ ЗначениеЗаполнено(ТекущийНаборЗаписей.Идентификатор) Тогда
			ТекущийНаборЗаписей.Идентификатор = Новый УникальныйИдентификатор();
		Иначе
			ТекущийНаборЗаписей.Идентификатор = Идентификатор;
		КонецЕсли;
				
		НаборЗаписей.Записать(Истина);
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции
